podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SPI0_MKV10Z7.svd.xml
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>TXFR%s</name>
               <description>Transmit FIFO</description>
               <addressOffset>0x3C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TXCMD_TXDATA</name>
                     <description>Transmit Command or Transmit Data</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>RXFR%s</name>
               <description>Receive FIFO</description>
               <addressOffset>0x7C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>Receive Data</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SREX</name>
               <description>Status register Extended</description>
               <addressOffset>0x13C</addressOffset>
               <fields>
                  <field>
                     <name>CMDNXTPTR</name>
                     <description>Command Next Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CMDCTR</name>
                     <description>CMD FIFO Counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXCTR4</name>
                     <description>TX FIFO Counter[4]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCTR4</name>
                     <description>RX FIFO Counter[4]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
